CSI API ETABS v1
cPropAreaSpring.GetAreaSpringProp Method
 Retrieves an existing named area spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAreaSpringProp(
	string Name,
	ref double U1,
	ref double U2,
	ref double U3,
	ref int NonlinearOption3,
	ref int SpringOption,
	ref string SoilProfile,
	ref double EndLengthRatio,
	ref double Period,
	ref int color,
	ref string notes,
	ref string iGUID
)
Function GetAreaSpringProp (
	Name As String,
	ByRef U1 As Double,
	ByRef U2 As Double,
	ByRef U3 As Double,
	ByRef NonlinearOption3 As Integer,
	ByRef SpringOption As Integer,
	ByRef SoilProfile As String,
	ByRef EndLengthRatio As Double,
	ByRef Period As Double,
	ByRef color As Integer,
	ByRef notes As String,
	ByRef iGUID As String
) As Integer
Dim instance As cPropAreaSpring
Dim Name As String
Dim U1 As Double
Dim U2 As Double
Dim U3 As Double
Dim NonlinearOption3 As Integer
Dim SpringOption As Integer
Dim SoilProfile As String
Dim EndLengthRatio As Double
Dim Period As Double
Dim color As Integer
Dim notes As String
Dim iGUID As String
Dim returnValue As Integer
returnValue = instance.GetAreaSpringProp(Name,
	U1, U2, U3, NonlinearOption3, SpringOption,
	SoilProfile, EndLengthRatio, Period,
	color, notes, iGUID)
int GetAreaSpringProp(
	String^ Name,
	double% U1,
	double% U2,
	double% U3,
	int% NonlinearOption3,
	int% SpringOption,
	String^% SoilProfile,
	double% EndLengthRatio,
	double% Period,
	int% color,
	String^% notes,
	String^% iGUID
)
abstract GetAreaSpringProp :
        Name : string *
        U1 : float byref *
        U2 : float byref *
        U3 : float byref *
        NonlinearOption3 : int byref *
        SpringOption : int byref *
        SoilProfile : string byref *
        EndLengthRatio : float byref *
        Period : float byref *
        color : int byref *
        notes : string byref *
        iGUID : string byref -> int
Parameters
Name
Type: System.String
 The name of the area spring property.
U1
Type: System.Double
 The spring stiffness per unit area in the local 1 direction [F/L3]
U2
Type: System.Double
 The spring stiffness per unit area in the local 2 direction [F/L3]
U3
Type: System.Double
 The spring stiffness per unit area in the local 3 direction [F/L3]
NonlinearOption3
Type: System.Int32
 The nonlinear option for the local 3 direction, this is one of the following values:
0 = (None) Linear - Resists Tension and Compression
1 = Resists Compression only
2 = Resists Tension only
SpringOption
Type: System.Int32
 This argument is for a future release, however a placeholder of type Integer is required
SoilProfile
Type: System.String
 This argument is for a future release, however a placeholder of type String is required
EndLengthRatio
Type: System.Double
 This argument is for a future release, however a placeholder of type Double is required
Period
Type: System.Double
 This argument is for a future release, however a placeholder of type Double is required
color
Type: System.Int32
 The display color for the property specified as an integer
notes
Type: System.String
 The notes, if any, assigned to the property
iGUID
Type: System.String
 The GUID (global unique identifier), if any, assigned to the property
Return Value
Type: Int32
 Returns zero if the property is successfully set, otherwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
   ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
   ret = SapModel.PropAreaSpring.SetAreaSpringProp("mySpringProp1", 0, 0, 100, 0)
'get property
   Dim U1 As Double
   Dim U2 As Double
   Dim U3 As Double
   Dim NonlinearOption2 As Integer
   Dim SpringOption As Integer
   Dim SoilProfile As String
   Dim EndLengthRatio As Double
   Dim Period As Double
   Dim color As Integer
   Dim notes As String
   Dim iGuid As String
   ret = SapModel.PropAreaSpring.GetAreaSpringProp("mySpringProp1", U1, U2, U3, NonlinearOption3, SpringOption, SoilProfile, EndLengthRatio, Period, color, notes, iGuid)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropAreaSpring Interface
ETABSv1 Namespace